Examples/CodeStream/cylinderWithSwak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        nFaces          60;
        startFace       3890;
    }
    right
    {
        type            patch;
        nFaces          30;
        startFace       3950;
    }
    up
    {
        type            symmetryPlane;
        nFaces          60;
        startFace       3980;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       4040;
    }
    cylinder
    {
        type            symmetryPlane;
        nFaces          40;
        startFace       4070;
    }
    defaultFaces
    {
        type            empty;
        nFaces          4000;
        startFace       4110;
    }
)

// ************************************************************************* //
